#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-f32a9667-9af8-4353-a6ab-8f6494f28d40-ef482e61-3a30-4e45-a2c0-8fd584d6937b]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.github_actions_aadapplication["first_test"] will be created
  + resource "azuread_application" "github_actions_aadapplication" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "github-actions-backstage-test-tfplan"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "ef482e61-3a30-4e45-a2c0-8fd584d6937b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # azuread_application_federated_identity_credential.cred["first_test"] will be created
  + resource "azuread_application_federated_identity_credential" "cred" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "Terraform deployments for badbort/backstage-test"
      + display_name          = "backstage-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:badbort/backstage-test:environment:tfplan"
    }

  # azurerm_storage_container.tf_backends_sc["backstage_test"] will be created
  + resource "azurerm_storage_container" "tf_backends_sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "backstage-testing"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "badbortcommontfstatesta"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*